---
kind: method
id: M:Autodesk.Revit.DB.FilterNumericRuleEvaluator.Dispose
source: html/6726f509-1d75-7abb-cde6-bfbeebff2287.htm
---
# Autodesk.Revit.DB.FilterNumericRuleEvaluator.Dispose Method

Releases all resources used by the FilterNumericRuleEvaluator

## Syntax (C#)
```csharp
public void Dispose()
```